<script setup lang='ts'>
import { Icon } from '@iconify/vue';
import { useI18n } from 'vue-i18n';
// !資料 --------------------------------------------------------------------------------------------
// const props = defineProps({}); definePageMeta({});

// !接收事件 -----------------------------------------------------------------------------------------

// !流程 --------------------------------------------------------------------------------------------

// !函式 --------------------------------------------------------------------------------------------

// !Api ---------------------------------------------------------------------------------------------

// !生命週期 -----------------------------------------------------------------------------------------
// onMounted(()=>{});

// !對外事件 -----------------------------------------------------------------------------------------
// const emit = defineEmits(['update:modelValue','on-change']);

// !Ref 輸出 ----------------------------------------------------------------------------------------
// defineExpose({ ... })

</script>

<template lang='pug'>
  #Cooperate
    .wrap
      div(class="grid grid-rows-2 gap-5 h-full")
        div(class="row-span-1 bg-t-white rounded-md p-4")
          div(class="font-semibold text-xl") 服務內容
        div(class="row-span-1 bg-t-white rounded-md p-4") 2
</template>

<style lang='scss' scoped>
#Cooperate{
  padding:20px;
}
</style>